aa8764114/nRF5_SDK_15.3.0_59ac345/components/ble_ssm2/history.c
#include "history.h"

#include "string.h"
#include "fds.h"
#include "fdsx.h"
#include "app_scheduler.h"

#include "misc.h"
#include "session.h"
#include "ble_ssm2.h"

#define NRF_LOG_MODULE_NAME     HST
#define NRF_LOG_LEVEL           NRF_LOG_SEVERITY_DEBUG
#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();
#include "nrf_log_ctrl.h"

#ifdef HISTORY_USE_SCHEDULER
#include "app_scheduler.h"
#endif

#define ONLY_ADD_FROM_IRQ_PRIORITY      APP_IRQ_PRIORITY_LOW
#ifdef ONLY_ADD_FROM_IRQ_PRIORITY
#ifdef DEBUG
    #define IRQ_PRIORITY_GUARD_ENTER()      APP_ERROR_CHECK_BOOL((current_int_priority_get() == ONLY_ADD_FROM_IRQ_PRIORITY))
    #else
    #define IRQ_PRIORITY_GUARD_ENTER()
    #endif
#define IRQ_PRIORITY_GUARD_EXIT()
#else
#define IRQ_PRIORITY_GUARD_ENTER()      CRITICAL_REGION_ENTER()
#define IRQ_PRIORITY_GUARD_EXIT()       CRITICAL_REGION_EXIT()
#endif

#ifndef DEPRECATED_DEFINITION

#define MAX_HISTORY_COUNT       (128)
#define WRITE_BUFFER_COUNT      (8)

#define STORED_HISTORY_LEN(_type)               (offsetof(history_content_t, data) + history_data_len[(_type)])
#define CHECK_RECORD_TYPE_AND_LENGTH(_record)  \
    (   ((history_buffer_t*)(_record).p_data)->data.type < ARRAY_SIZE(history_data_len) && \
    BYTES_TO_WORDS(STORED_HISTORY_LEN( ((history_buffer_t*)(_record).p_data)->data.type )) == (_record).p_header->length_words)


#define TRANSFER_BUFFER_CNT     (16)

typedef PACKED_STRUCT history_read_content_s
{
    uint8_t     flag_time_unreliable    : 1;
    uint8_t     flag_reserved           : 7;
    uint64_t    time_ms;
    union {
        history_ble_lock_t              ble_lock;
        history_ble_unlock_t            ble_unlock;
        history_time_changed_t          time_changed;
        history_autolock_updated_t      autolock_updated;
        history_mech_setting_updated_t  mech_setting_updated;
        history_autolock_t              autolock;
        history_manual_locked_t         manual_locked;
        history_manual_unlocked_t       manual_unlocked;
        history_manual_else_t           manual_else;
        history_drive_locked_t          drive_locked;
        history_drive_unlocked_t        drive_unlocked;
        history_drive_failed_t          drive_failed;
    } data;
} history_read_content_t;

typedef PACKED_STRUCT publish_history_s
{
    uint16_t            op          : 8;
    uint16_t            item        : 8;
    uint8_t             sig[4];
    uint8_t             type;
    uint16_t            idx;
    uint32_t            record_id;
    history_read_content_t   content;
} publish_history_t;


typedef struct transfer_info_s
{
    session_t*          session;
    uint16_t            idx;

    uint8_t             count;
//    uint8_t             buffer_idx;
//    history_buffer_t    buffer[TRANSFER_BUFFER_CNT];
    bool                enabled;
} transfer_info_t;

static transfer_info_t transfer;

typedef struct history_buffer_s
{
    uint16_t            idx;
    union {
        uint32_t        for_4_byte_aligned;
        history_content_t   data;
    } his_cont;
} history_buffer_t;
STATIC_ASSERT(sizeof(history_buffer_t) % 4 == 0);
STATIC_ASSERT(offsetof(history_buffer_t, his_cont.data) % 4 == 0);

typedef struct history_info_s
{
    uint16_t            oldest_idx;
    uint16_t            count;
    history_buffer_t    write_buffer[WRITE_BUFFER_COUNT];
    uint8_t             write_buffer_idx;
    uint8_t             time_reliable;
} history_info_t;

static history_info_t info;
STATIC_ASSERT(IS_ALIGNED(&info.write_buffer[0], 4));
STATIC_ASSERT(IS_ALIGNED(&info.write_buffer[0].his_cont.data, 4));
STATIC_ASSERT(IS_ALIGNED(&info.oldest_idx, 4));

const static uint8_t history_data_len[] = {
        sizeof(history_no_data_t),
        sizeof(history_ble_lock_t),
        sizeof(history_ble_unlock_t),
        sizeof(history_time_changed_t),
        sizeof(history_autolock_updated_t),
        sizeof(history_mech_setting_updated_t),
        sizeof(history_autolock_t),
        sizeof(history_manual_locked_t),
        sizeof(history_manual_unlocked_t),
        sizeof(history_manual_else_t),
        sizeof(history_drive_locked_t),
        sizeof(history_drive_unlocked_t),
        sizeof(history_drive_failed_t),
        sizeof(history_ble_adv_param_updated_t),
};
STATIC_ASSERT(ARRAY_SIZE(history_data_len) == HISTORY_TYPE_COUNT);
STATIC_ASSERT(sizeof(history_content_t) == 73);
STATIC_ASSERT(offsetof(history_content_t, data) + sizeof(history_mech_setting_updated_t) == 73);
STATIC_ASSERT(BYTES_TO_WORDS(sizeof(history_content_t)) <= FDSX_MAX_DATA_LEN_WORDS);

void history_init(void)
{
    memset(&info, 0, sizeof(info));
    memset(&transfer, 0, sizeof(transfer));
}

bool history_on_init_iter_record(fds_flash_record_t const * record)
{
    static uint32_t oldest_record_id = UINT32_MAX;
    static uint32_t newest_record_id = 0;
    static uint32_t newest_idx_record_id = 0;
    uint16_t idx = REC_KEY_TO_IDX(record->p_header->record_key);
    history_content_t const * data = (history_content_t const*)record->p_data;

    switch (record->p_header->file_id)
    {
        case FILE_ID_HISTORY:
        {
            if (data->type >= ARRAY_SIZE(history_data_len) ||
                BYTES_TO_WORDS(STORED_HISTORY_LEN(data->type)) != record->p_header->length_words)
            {
                NRF_LOG_ERROR("[%s] type=%d, expected_length_words=%d", __func__, data->type, BYTES_TO_WORDS(STORED_HISTORY_LEN(data->type)));
                return true;
            }
            if (record->p_header->record_id < oldest_record_id)
            {
                oldest_record_id = record->p_header->record_id;
                info.oldest_idx = idx;
            }
            if (record->p_header->record_id > newest_record_id)
            {
                newest_record_id = record->p_header->record_id;
            }
            info.count++;
            NRF_LOG_INFO("[%s] record_id=%d, idx=%d, type=%d, time=%llu, oldest_record_id=%d", __func__, record->p_header->record_id, idx, data->type, data->time_ms, oldest_record_id);
            break;
        }
        case FILE_ID_HISTORY_IDX:
            if (record->p_header->record_id < newest_idx_record_id)
            {
                NRF_LOG_WARNING("[%s] old history_idx file, deleted", __func__);
                return true;
            }
            else
            {
                if (newest_idx_record_id)
                {
                    ret_code_t err_code = fdsx_delete_by_record_id(newest_idx_record_id);

