aa8764114/nRF5_SDK_15.3.0_59ac345/components/ble_ssm2/history.c
                    if (err_code == NRF_ERROR_RESOURCES)
                    {
                        fdsx_wait_for_all_jobs();
                        err_code = fdsx_delete_by_record_id(newest_idx_record_id);
                    }
                    APP_ERROR_CHECK(err_code);
                }
                newest_idx_record_id = record->p_header->record_id;
                info.oldest_idx = *(uint16_t*)record->p_data;
                NRF_LOG_DEBUG("[%s] newest_idx_record_id=%d, oldest_idx=%d", __func__, newest_idx_record_id, info.oldest_idx);
            }
            break;
        default:
            NRF_LOG_WARNING("[%s] unexpected file, deleted", __func__);
            return true;
    }
    return false;
}

static ret_code_t trim_history(void)
{
    ret_code_t err_code = NRF_SUCCESS;

    while (info.count > MAX_HISTORY_COUNT)
    {
        err_code = fdsx_delete(FILE_ID_HISTORY, IDX_TO_REC_KEY(info.oldest_idx));
        if (err_code == NRF_SUCCESS)
        {
            NRF_LOG_INFO("[%s] fdsx_delete(idx=%d)=%d", __func__, info.oldest_idx, err_code);
        }
        else
        {
            NRF_LOG_ERROR("[%s] fdsx_delete(idx=%d)=%d", __func__, info.oldest_idx, err_code);
            break;
        }
//            IRQ_PRIORITY_GUARD_ENTER();
        info.count--;
        info.oldest_idx = (info.oldest_idx + 1) % 0xBFFF;
//            IRQ_PRIORITY_GUARD_EXIT();
    }
    return err_code;
}

static void handle_fragment(void)
{
    ret_code_t err_code;
    fds_record_desc_t desc;
    fds_find_token_t token;
    fds_flash_record_t record;
    uint16_t i = info.oldest_idx;
    uint32_t last_record_id = 0;
    uint16_t cnt = 0;

    memset(&token, 0, sizeof(token));
    while (fds_record_find_in_file(FILE_ID_HISTORY, &desc, &token) == FDS_SUCCESS)
    {
        err_code = fds_record_open(&desc, &record);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_DEBUG("[%s] record_id=%d, rec_key=%d, length_words=%d", __func__, record.p_header->record_id, record.p_header->record_key, record.p_header->length_words);
        if (record.p_header->record_id > last_record_id)
        {
            NRF_LOG_DEBUG("[%s] update last_record_id %d => %d", __func__, last_record_id, record.p_header->record_id);
            last_record_id = record.p_header->record_id;
            i = REC_KEY_TO_IDX(record.p_header->record_key);
        }

        err_code = fds_record_close(&desc);
        APP_ERROR_CHECK(err_code);
        cnt++;
        NRF_LOG_FLUSH();
    }

    if (cnt > 1)
    {
        info.count = 0;
        while (cnt)
        {
            memset(&token, 0, sizeof(token));
            err_code = fds_record_find(FILE_ID_HISTORY, IDX_TO_REC_KEY(i), &desc, &token);
            NRF_LOG_DEBUG("[%s] cnt=%d, idx=%d, fds_record_find()=%d", __func__, cnt, i, err_code);
            NRF_LOG_FLUSH();
            if (err_code == FDS_SUCCESS)
            {
                err_code = fds_record_open(&desc, &record);
                APP_ERROR_CHECK(err_code);

                info.oldest_idx = i;
                info.count++;
                last_record_id = record.p_header->record_id;

                err_code = fds_record_close(&desc);
                APP_ERROR_CHECK(err_code);

                i = i > 0 ? i-1 : 0xBFFF-1;
                cnt--;

                NRF_LOG_DEBUG("[%s] cnt=%d, idx=%d, record_id=%d, rec_key=%d, length_words=%d", __func__, cnt, i, record.p_header->record_id, record.p_header->record_key, record.p_header->length_words);
                NRF_LOG_FLUSH();
            }
            else
            {
                NRF_LOG_INFO("[%s] largest missing idx=%d, oldest continuous idx=%d, count=%d, record_id=%d", __func__, i, info.oldest_idx, info.count, last_record_id);
                NRF_LOG_FLUSH();
                memset(&token, 0, sizeof(token));
                while (fds_record_find_in_file(FILE_ID_HISTORY, &desc, &token) == FDS_SUCCESS)
                {
                    uint32_t record_id;

                    err_code = fds_record_open(&desc, &record);
                    APP_ERROR_CHECK(err_code);

                    record_id = record.p_header->record_id;

                    err_code = fds_record_close(&desc);
                    APP_ERROR_CHECK(err_code);

                    NRF_LOG_DEBUG("[%s] record_id=%d, last_record_id=%d", __func__, record_id, last_record_id);

                    if (record_id < last_record_id)
                    {
                        /*
                         * ok to wait here as this should be called a THREAD priority
                         */
                        APP_ERROR_CHECK_BOOL((current_int_priority_get() == APP_IRQ_PRIORITY_THREAD));
                        err_code = fdsx_delete_by_record_id(record_id);
                        if (err_code == FDS_ERR_NO_SPACE_IN_QUEUES)
                        {
                            fdsx_wait_for_all_jobs();
                            err_code = fdsx_delete_by_record_id(record_id);
                        }
                        if (err_code == NRF_SUCCESS)
                        {
                            NRF_LOG_INFO("[%s] fdsx_delete_by_record_id(idx=%d)=%d", __func__, i, err_code);
                        }
                        else
                        {
                            NRF_LOG_ERROR("[%s] fdsx_delete_by_record_id(idx=%d)=%d", __func__, i, err_code);
                        }
                    }
                    NRF_LOG_FLUSH();
                }
                return;
            }
        }
    }
}

ret_code_t history_on_init_iter_done(void)
{
    ret_code_t err_code;

    NRF_LOG_INFO("[%s] (enter) count=%d, oldest_idx=%d", __func__, info.count, info.oldest_idx);
    NRF_LOG_FLUSH();
    if (info.count > 0)
    {
        handle_fragment();
        err_code = trim_history();
        APP_ERROR_CHECK(err_code);
    }
    NRF_LOG_INFO("[%s] (exit) count=%d, oldest_idx=%d", __func__, info.count, info.oldest_idx);
    return NRF_SUCCESS;
}

uint16_t history_get_count(void)
{
    return info.count;
}

