aa8764114/nRF5_SDK_15.3.0_59ac345/components/ble_ssm2/history.c
static uint16_t acquire_idx(void)
{
    uint16_t ret;

    IRQ_PRIORITY_GUARD_ENTER();
    ret = info.oldest_idx + info.count;
    info.count++;
    IRQ_PRIORITY_GUARD_EXIT();

    return ret;
}

static history_buffer_t* acquire_buffer(void)
{
    history_buffer_t* ret;

    IRQ_PRIORITY_GUARD_ENTER();
    ret = &info.write_buffer[info.write_buffer_idx];
    info.write_buffer_idx = (info.write_buffer_idx + 1) % ARRAY_SIZE(info.write_buffer);
    IRQ_PRIORITY_GUARD_EXIT();

    memset(ret, 0, sizeof(*ret));
    //ret->his_cont.data.flag_time_unreliable = info.time_reliable ? 1 : 0;
    ret->his_cont.data.time_ms = app_timer_get_epoch_ms();
    return ret;
}

static ret_code_t write_history(history_buffer_t * p_buffer)
{
    ret_code_t err_code;

//    APP_ERROR_CHECK_BOOL(p_buffer != NULL);
//    NRF_LOG_DEBUG("[%s] type=%d", __func__, p_buffer->data.type);
    APP_ERROR_CHECK_BOOL(p_buffer->his_cont.data.type < HISTORY_TYPE_COUNT);

    p_buffer->idx = acquire_idx();

    NRF_LOG_DEBUG("[%s] type=%d, write_data: (len=%d)", __func__, p_buffer->his_cont.data.type, STORED_HISTORY_LEN(p_buffer->his_cont.data.type));
    NRF_LOG_HEXDUMP_DEBUG(&p_buffer->his_cont.data, STORED_HISTORY_LEN(p_buffer->his_cont.data.type));

    err_code = fdsx_write(FILE_ID_HISTORY, IDX_TO_REC_KEY(p_buffer->idx), &p_buffer->his_cont.data, STORED_HISTORY_LEN(p_buffer->his_cont.data.type));
    if (err_code == NRF_SUCCESS)
    {
        NRF_LOG_INFO("[%s] fdsx_write(idx=%d, type=%d)=0", __func__, p_buffer->idx, p_buffer->his_cont.data.type);
        err_code = trim_history();
    }
    else
    {
        NRF_LOG_ERROR("[%s] fdsx_write(idx=%d, type=%d)=%d", __func__, p_buffer->idx, p_buffer->his_cont.data.type, err_code);
    }
    return err_code;
}

#ifdef HISTORY_USE_SCHEDULER
static void history_sched_handler(void * p_event_data, uint16_t event_size)
{
    history_buffer_t * p_buffer;

    if (event_size != sizeof(history_buffer_t **))
    {
        NRF_LOG_ERROR("[%s] event_size=%d, ignored", __func__, event_size);
        return;
    }

    p_buffer = *(history_buffer_t**) p_event_data;

    if (p_buffer->type >= HISTORY_TYPE_COUNT)
    {
        NRF_LOG_ERROR("[%s] type=%d, ignored", __func__, p_buffer->type);
        return;
    }

    write_history(p_buffer);
}
#endif

static ret_code_t history_add(uint8_t type, void* data, uint16_t len)
{
    history_buffer_t* p_buffer = acquire_buffer();

//    APP_ERROR_CHECK_BOOL(p_buffer != NULL);

    p_buffer->his_cont.data.type = type;

    if (data && len)
    {
        memcpy(&p_buffer->his_cont.data.data, data, len);
    }

#ifdef HISTORY_USE_SCHEDULER
    return app_sched_event_put(&p_buffer, sizeof(p_buffer), history_sched_handler);
#else
    return write_history(p_buffer);
#endif
}

ret_code_t history_add_with_ble_peer_ex(history_type_e type, uint16_t key_idx, uint8_t const * device_id, uint8_t* payload, uint8_t payload_len)
{
    history_ble_lock_t data;

    if (!payload || payload_len != sizeof(data.payload))
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    /*
     * since history_ble_lock_t and history_ble_unlock_t are the same
     * sharing code as below should be legal according to C spec
     */

    data.key_idx = key_idx;
    memcpy(data.device, device_id, sizeof(data.device));
    memcpy(data.payload, payload, sizeof(data.payload));
    STATIC_ASSERT(sizeof(data.device) == HISTORY_DEVICE_LEN);
    STATIC_ASSERT(sizeof(data.payload) == HISTORY_PAYLOAD_LEN_MAX);

    return history_add(type, &data, sizeof(data));
}

ret_code_t history_add_mech_setting_updated(history_mech_setting_updated_t* history)
{
    return history_add(HISTORY_TYPE_MECH_SETTING_UPDATED, history, sizeof(*history));
}

ret_code_t history_add_time_changed(uint16_t user_idx, uint8_t const * device_id, uint32_t new_time, uint32_t old_time)
{
    history_time_changed_t data;

    data.key_idx = user_idx;
    memcpy(data.device, device_id, sizeof(data.device));
    memcpy(data.new_time, &new_time, sizeof(data.new_time));
    memcpy(data.time_before, &old_time, sizeof(data.time_before));

    return history_add(HISTORY_TYPE_TIME_CHANGED, &data, sizeof(data));
}

ret_code_t history_add_autolock_updated_ex(uint16_t key_idx, uint8_t const * device_id, uint16_t second, uint16_t old_second, uint8_t* payload, uint8_t payload_len)
{
    history_autolock_updated_t data;

    if (!payload || payload_len != sizeof(data.payload))
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    data.key_idx = key_idx;
    memcpy(data.device, device_id, sizeof(data.device));
    data.second_before = old_second;
    data.second_after = second;
    memcpy(data.payload, payload, sizeof(data.payload));

    return history_add(HISTORY_TYPE_AUTOLOCK_UPDATED, &data, sizeof(data));
}

ret_code_t history_add_simple_type(history_type_e type)
{
    return history_add(type, NULL, 0);
}

ret_code_t history_add_drive_failed(int16_t stopped_position, uint8_t fsm_ret_code, uint8_t in_lock_region, uint8_t in_unlock_region)
{
    history_drive_failed_t data;

    data.stopped_position = stopped_position;
    data.fsm_ret_code = fsm_ret_code;
    data.in_lock_region = in_lock_region;
    data.in_unlock_region = in_unlock_region;

    return history_add(HISTORY_TYPE_DRIVE_FAILED, &data, sizeof(data));
}

ret_code_t history_add_ble_adv_param(history_ble_adv_param_updated_t* history)
{
    return history_add(HISTORY_TYPE_BLE_ADV_PARAM_UPDATED, history, sizeof(*history));
}

void history_set_time_reliable(uint8_t reliable)
{
    info.time_reliable = reliable;
}

ret_code_t history_transfer_init(history_transfer_t* cfg)
{
    if (!cfg)
    {
        memset(&transfer, 0, sizeof(transfer));
        return NRF_SUCCESS;
    }
    if (transfer.enabled)
    {
        return NRF_ERROR_BUSY;
    }

    memset(&transfer, 0, sizeof(transfer));
    transfer.session = cfg->session;
    transfer.idx = info.oldest_idx;
    transfer.count = (cfg->count > info.count || cfg->count == 0) ? info.count : cfg->count;

    cfg->count = transfer.count;
    cfg->idx_start = transfer.idx;
    if (transfer.count == 0)
    {
        cfg->idx_end = cfg->idx_start;
    }
    else
    {
        cfg->idx_end = (transfer.idx + transfer.count - 1) % MAX_HISTORY_COUNT;
    }

