aa8764114/nRF5_SDK_15.3.0_59ac345/components/ble_ssm2/history.c
    if (cfg->count > 0)
    {
        ret_code_t err_code;
        uint8_t data[4];        // not important as we only do fake read here and fds read API accepts partial read
        uint16_t word_len = sizeof(data) / 4;

        err_code = fdsx_read_ex(FILE_ID_HISTORY, IDX_TO_REC_KEY(cfg->idx_start), data, &word_len, &cfg->first_record_id);
        if (err_code != NRF_SUCCESS)
        {
            NRF_LOG_ERROR("fdsx_read_ex(idx_start=%d)=%d", cfg->idx_start, err_code);
            cfg->first_record_id = UINT32_MAX;
        }

        if (cfg->count > 1)
        {
            err_code = fdsx_read_ex(FILE_ID_HISTORY, IDX_TO_REC_KEY(cfg->idx_end), data, &word_len, &cfg->last_record_id);
            if (err_code != NRF_SUCCESS)
            {
                NRF_LOG_ERROR("fdsx_read_ex(idx_end=%d)=%d", cfg->idx_end, err_code);
                cfg->last_record_id = UINT32_MAX;
            }
        }
        else
        {
            cfg->last_record_id = cfg->first_record_id;
        }
    }
    else
    {
        cfg->first_record_id = UINT32_MAX;
        cfg->last_record_id = UINT32_MAX;
    }

    transfer.enabled = 1;
    return NRF_SUCCESS;

}

bool history_transfer_enabled(uint16_t conn_handle)
{
    return (transfer.enabled && transfer.session && conn_handle == transfer.session->conn_handle);
}

ret_code_t history_delete(cmd_delete_history_t const * cfg, session_t* session)
{
    ret_code_t err_code;
    uint16_t rec_key_out;

    if (!cfg)
    {
        return NRF_ERROR_NULL;
    }

    if (((info.oldest_idx - cfg->idx_start + 0xBFFF) % 0xBFFF >= cfg->delete_count))
    {
        NRF_LOG_WARNING("[%s] oldest not included, oldest_idx=%d, idx_start=%d, delete_count=%d", __func__, info.oldest_idx, cfg->idx_start, cfg->delete_count);
        return NRF_ERROR_INVALID_PARAM;
    }

    if (((cfg->idx_start + cfg->delete_count - 1 - info.oldest_idx + 0xBFFF) % 0xBFFF >= info.count))
    {
        NRF_LOG_WARNING("[%s] last to delete not existed, oldest_idx=%d, count=%d, idx_start=%d, delete_count=%d", __func__, info.oldest_idx, info.count, cfg->idx_start, cfg->delete_count);
        return NRF_ERROR_INVALID_PARAM;
    }

    {
        uint8_t context[offsetof(cmd_delete_history_t, server_sig)+8];
        uint8_t sig[sizeof(cfg->server_sig)];

        memcpy(context, &cfg->delete_count, offsetof(cmd_delete_history_t, server_token));
        memcpy(context+offsetof(cmd_delete_history_t, server_token), session_get_token(session), 8);
        memcpy(context+offsetof(cmd_delete_history_t, server_token)+8, cfg->server_token, sizeof(cfg->server_token));

        err_code = aes_cmac_ex(ble_ssm2_get_symm_key(), context, sizeof(context), sig, sizeof(cfg->server_sig));
        APP_ERROR_CHECK(err_code);
        if (memcmp(cfg->server_sig, sig, sizeof(cfg->server_sig)) != 0)
        {
            NRF_LOG_ERROR("[%s] expected sig:", __func__);
            NRF_LOG_HEXDUMP_ERROR(sig, sizeof(cfg->server_sig));
            NRF_LOG_ERROR("[%s] context: (len=%d)", __func__, sizeof(context));
            NRF_LOG_HEXDUMP_ERROR(context, sizeof(context));
            return NRF_ERROR_FORBIDDEN;
        }
    }

    rec_key_out = IDX_TO_REC_KEY(info.oldest_idx);
    err_code = fdsx_delete_old_record_in_file(FILE_ID_HISTORY, cfg->last_record_id, &info.count, &rec_key_out);
    APP_ERROR_CHECK(err_code);
    info.oldest_idx = REC_KEY_TO_IDX(rec_key_out);
    if (info.count == 0)
    {
        err_code = fdsx_write(FILE_ID_HISTORY_IDX, 1, &info.oldest_idx, sizeof(info.oldest_idx));
        APP_ERROR_CHECK(err_code);
    }

    return NRF_SUCCESS;
}

void history_transfer_on_hvn_tx_complete(session_t* session)
{
    ret_code_t err_code;

    if (history_transfer_enabled(session->conn_handle) && nrf_atflags_get(session->atflags, SESSION_FLAG_TX_HAS_MORE) == 0)
    {
        if (transfer.count == 0)
        {
            transfer.enabled = 0;
        }
        else
        {
            err_code = history_transfer_continue(session);
            APP_ERROR_CHECK(err_code);
        }
    }
}

uint16_t history_get_storage_length(history_type_e type)
{
    if (type >= ARRAY_SIZE(history_data_len))
    {
        return 0;
    }
    return STORED_HISTORY_LEN(type);
}

ret_code_t history_transfer_continue(session_t* session)
{
    ret_code_t err_code;
    publish_history_t pub;
    uint16_t plaintext_len;

    STATIC_ASSERT(offsetof(publish_history_t, content) == 13);
    STATIC_ASSERT(offsetof(history_read_content_t, data) == 9);
    STATIC_ASSERT(sizeof(history_read_content_t) == 73);
    STATIC_ASSERT(sizeof(history_content_t) == 73);

    pub.op = SSM2_OP_CODE_PUBLISH;
    pub.item = SSM2_ITEM_CODE_HISTORY;
    pub.idx = transfer.idx;

    {
        history_content_t content;
        uint32_t record_id;
        uint16_t word_len = sizeof(content) / 4;

        err_code = fdsx_read_ex(FILE_ID_HISTORY, IDX_TO_REC_KEY(transfer.idx), (uint8_t*)&content, &word_len, &record_id);
        if (err_code == NRF_SUCCESS)
        {
            pub.type = content.type;
            pub.record_id = record_id;
            //pub.content.flag_time_unreliable = content.flag_time_unreliable;
            //pub.content.flag_reserved = content.flag_reserved;
            pub.content.time_ms = content.time_ms;
            memcpy(&pub.content.data, &content.data, sizeof(pub.content.data));
            STATIC_ASSERT(sizeof(pub.content.data) == sizeof(content.data));

            if (STORED_HISTORY_LEN(pub.type) < (word_len * 4))
            {
                NRF_LOG_ERROR("[%s] expected_byte_len=%d, read_word_len=%d", __func__, STORED_HISTORY_LEN(pub.type), word_len);
            }
            else
            {
                NRF_LOG_DEBUG("[%s] read content: (len=%d)", __func__, STORED_HISTORY_LEN(pub.type));
                NRF_LOG_HEXDUMP_DEBUG(&content, STORED_HISTORY_LEN(pub.type));
            }
        }
        else
        {
            NRF_LOG_ERROR("[%s] fdsx_read_ex(idx=%d)=%d", __func__, transfer.idx, err_code);
            pub.type = HISTORY_TYPE_NONE;
        }
    }
    plaintext_len = offsetof(publish_history_t, content) + offsetof(history_read_content_t, data) + history_data_len[pub.type];

    err_code = aes_cmac_ex(ble_ssm2_get_symm_key(), &pub.type, plaintext_len - offsetof(publish_history_t, type), pub.sig, sizeof(pub.sig));
    APP_ERROR_CHECK(err_code);

    err_code = session_tx_add(transfer.session, SSM2_SEG_PARSING_TYPE_DIRECT, &pub, plaintext_len);
    APP_ERROR_CHECK(err_code);

