aa8764114/nRF5_SDK_15.3.0_59ac345/components/ble_ssm2/history.c
    transfer.count--;
    transfer.idx = (transfer.idx + 1) % MAX_HISTORY_COUNT;

    return NRF_SUCCESS;
}

#else   // #ifdef DEPRECATED_DEFINITION

#define HISTORY_STORAGE_FORMAT_0    (0)
#define HISTORY_WRITE_BUFFER_CNT    (8)
#define HISTORY_MAX_COUNT           (16)

#define HISTORY_ID_TO_FDS_REC_KEY(_id)      ((uint16_t)(_id) & 0xfff)

/*
 * Implementational structures
 */
typedef struct history_stored_format_0_s
{
    uint8_t     format;
    uint8_t     data_size;
    uint8_t     padding[2];
    uint32_t    history_id;
    uint8_t     content_bytes[sizeof(history_content_t)];
} history_stored_format_0_t;
STATIC_ASSERT(sizeof(history_content_t) <= 255);
STATIC_ASSERT(IS_ALIGNED(offsetof(history_stored_format_0_t, content_bytes), 4));
#define HISTORY_STORAGE_FORMAT_0_LEN_MIN    (offsetof(history_stored_format_0_t, content_bytes))
#define HISTORY_STORAGE_FORMAT_0_LEN_MAX    (sizeof(history_stored_format_0_t))

#define HISTORY_STORAGE_FORMAT              HISTORY_STORAGE_FORMAT_0
typedef history_stored_format_0_t history_stored_content_t;
#define HISTORY_STORAGE_LEN_MIN             HISTORY_STORAGE_FORMAT_0_LEN_MIN
#define HISTORY_STORAGE_LEN_MAX             HISTORY_STORAGE_FORMAT_0_LEN_MAX

typedef struct history_stored_idx_s
{
    uint8_t     format;
    uint8_t     padding[3];
    uint32_t    last_used_history_id;
} history_stored_idx_t;

typedef struct history_info_s
{
    history_transfer_t          transfer;
    history_stored_content_t    transferring_data;
    history_stored_content_t    write_buffer[HISTORY_WRITE_BUFFER_CNT];
    uint32_t                    history_id_oldest;
    uint32_t                    history_id_newest;
    uint32_t                    history_idx_record_id;
    uint16_t                    count;
    uint8_t                     write_buffer_idx;
    uint8_t                     time_reliable               : 1;
    uint8_t                     newest_id_updated           : 1;
    uint8_t                     history_idx_record_id_valid : 1;
} history_info_t;

static history_info_t info;


static bool is_u32_id_newer(uint32_t id1, uint32_t id2)
{
    if (id1 <= UINT32_MAX / 2)
    {
        return (id2 > id1 && id2 <= id1 + (UINT32_MAX / 2 + 1));
    }
    else
    {
        return (id2 > id1 || id2 <= id1 - (UINT32_MAX / 2 + 1));
    }
}

static ret_code_t delete_old_history_idx_record(void)
{
    ret_code_t err_code = NRF_SUCCESS;

    if (info.history_idx_record_id_valid)
    {
        fdsx_wait_for_all_jobs();
        err_code = fdsx_delete_by_record_id(info.history_idx_record_id);
        fdsx_wait_for_all_jobs();
        if (err_code == NRF_SUCCESS)
        {
            info.history_idx_record_id_valid = 0;
        }
    }
    return err_code;
}


void history_init(void)
{
    memset(&info, 0, sizeof(info));
    info.history_id_oldest = UINT32_MAX;
    info.history_id_newest = 0;
}

bool history_on_init_iter_record(fds_flash_record_t const * record)
{
    if (!record->p_data)
    {
        return true;
    }

    switch (record->p_header->file_id)
    {
        case FILE_ID_HISTORY:
        {
            history_stored_content_t const * data = (history_stored_content_t const*)record->p_data;

            if (data->format != HISTORY_STORAGE_FORMAT ||
                record->p_header->length_words < BYTES_TO_WORDS(HISTORY_STORAGE_LEN_MIN) ||
                record->p_header->length_words > BYTES_TO_WORDS(HISTORY_STORAGE_LEN_MAX) ||
                record->p_header->length_words != BYTES_TO_WORDS(offsetof(history_stored_content_t, content_bytes) + data->data_size))
            {
                NRF_LOG_ERROR("[%s] FILE_ID_HISTORY: format=%d, record_length_words=%d, data_size=%d", __func__, data->format, record->p_header->length_words, data->type, data->data_size);
                return true;
            }
            if (info.newest_id_updated == 0)
            {
                info.history_id_oldest = data->history_id;
                info.history_id_newest = data->history_id;
                info.newest_id_updated = 1;
            }
            else if (is_u32_id_newer(info.history_id_oldest, data->history_id))
            {
                info.history_id_oldest = data->history_id;
            }
            else if (is_u32_id_newer(data->history_id, info.history_id_newest))
            {
                info.history_id_newest = data->history_id;
            }
            info.count++;
            NRF_LOG_DEBUG("[%s] history_id=%d, data_size=%d", __func__, data->history_id, data->data_size);
            break;
        }
        case FILE_ID_HISTORY_IDX:
        {
            history_stored_idx_t const * data = (history_stored_idx_t const*)record->p_data;
            ret_code_t err_code;

            if (data->format != HISTORY_STORAGE_FORMAT ||
                record->p_header->length_words != BYTES_TO_WORDS(sizeof(history_stored_idx_t)))
            {
                NRF_LOG_ERROR("[%s] FILE_ID_HISTORY_IDX: format=%d, record_length_words=%d", __func__, data->format, record->p_header->length_words, data->type);
                return true;
            }

            if (info.newest_id_updated)
            {
                NRF_LOG_ERROR("[%s] FILE_ID_HISTORY_IDX: newest_id_updated=1", __func__);
                err_code = delete_old_history_idx_record();
                APP_ERROR_CHECK(err_code);
                return true;
            }

            if (info.history_idx_record_id_valid == 1)
            {
                if (is_u32_id_newer(record->p_header->record_id, info.history_idx_record_id))
                {
                    err_code = delete_old_history_idx_record();
                    APP_ERROR_CHECK(err_code);
                }
                else
                {
                    return true;
                }
            }

            info.history_idx_record_id_valid = 1;
            info.history_idx_record_id = record->p_header->record_id;

            info.history_id_oldest = data->last_used_history_id;
            info.history_id_newest = data->last_used_history_id;

            NRF_LOG_INFO("[%s] FILE_ID_HISTORY_IDX: last_used_history_id=%u", data->last_used_history_id);
            break;
        }
        default:
            NRF_LOG_WARNING("[%s] unexpected file, deleted", __func__);
            return true;
    }
    return false;
}

