aa8764114/nRF5_SDK_15.3.0_59ac345/components/ble_ssm2/history.c
static ret_code_t trim_history(void)
{
    ret_code_t err_code;
    uint16_t count;

    IRQ_PRIORITY_GUARD_ENTER();
    count = info.count;
    IRQ_PRIORITY_GUARD_EXIT();

    while (count > HISTORY_MAX_COUNT)
    {
        fdsx_wait_for_all_jobs();
        err_code = fdsx_delete(FILE_ID_HISTORY, HISTORY_ID_TO_FDS_REC_KEY(info.history_id_oldest));
        APP_ERROR_CHECK(err_code);

        IRQ_PRIORITY_GUARD_ENTER();
        info.count--;
        info.history_id_oldest++;
        count = info.count;
        IRQ_PRIORITY_GUARD_EXIT();
    }
    return NRF_SUCCESS;
}

ret_code_t history_on_init_iter_done(void)
{
    ret_code_t err_code;

    NRF_LOG_INFO("[%s] (enter) count=%u (%u ~ %u)", __func__, info.count, info.history_id_oldest, info.history_id_newest);
    NRF_LOG_FLUSH();
    err_code = trim_history();
    APP_ERROR_CHECK(err_code);
    NRF_LOG_INFO("[%s] (exit) count=%u (%u ~ %u)", __func__, info.count, info.history_id_oldest, info.history_id_newest);
    return NRF_SUCCESS;
}

uint16_t history_get_count(void)
{
    return info.count;
}

static history_stored_content_t* acquire_buffer(void)
{
    history_stored_content_t* ret;
    history_content_t* p_content;

    IRQ_PRIORITY_GUARD_ENTER();
    ret = &info.write_buffer[info.write_buffer_idx];
    info.write_buffer_idx = (info.write_buffer_idx + 1) % ARRAY_SIZE(info.write_buffer);

    memset(ret, 0, sizeof(*ret));

    p_content = (history_content_t*)ret->content_bytes;
    p_content->flag_time_unreliable = info.time_reliable ? 1 : 0;
    p_content->time = app_timer_get_epoch_sec();

    ret->history_id = info.history_id_newest + 1;
    info.history_id_newest++;

    IRQ_PRIORITY_GUARD_EXIT();
    return ret;
}

static ret_code_t history_add(uint8_t type, void* data, uint16_t len)
{
    if (!data || len == 0 || len > sizeof(history_content_t))
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    else
    {
        history_stored_content_t* p_buffer = acquire_buffer();
        ret_code_t err_code;
        uint32_t record_id;

        p_buffer->format = HISTORY_STORAGE_FORMAT;
        p_buffer->data_size = len;

        memcpy(p_buffer->content_bytes, data, len);

        err_code = fdsx_write_ex(FILE_ID_HISTORY, HISTORY_ID_TO_FDS_REC_KEY(p_buffer->history_id), p_buffer, offsetof(history_stored_content_t, content_bytes) + len, &record_id);
        if (err_code == NRF_SUCCESS)
        {
            NRF_LOG_INFO("[%s] fdsx_write(history_id=%u, data_size=%d)=0, record_id=%u", __func__, p_buffer->history_id, len, record_id);
            err_code = trim_history();
            APP_ERROR_CHECH(err_code);
        }
        else
        {
            NRF_LOG_ERROR("[%s] fdsx_write(history_id=%u, data_size=%d)=0", __func__, p_buffer->history_id, len);
        }
        return err_code;
    }
}

ret_code_t history_add_with_ble_peer_ex(history_type_e type, uint16_t key_idx, uint8_t const * device_id, uint8_t* payload, uint8_t payload_len)
{
    /*
     * since history_ble_lock_t and history_ble_unlock_t are the same
     * sharing code as below should be legal according to C spec
     */
    history_ble_lock_t content_data;

    memset(&content_data, 0, sizeof(content_data));

    if (type >= HISTORY_TYPE_COUNT || !device_id)
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    if (payload)
    {
        if (payload_len == 0 || payload_len > sizeof(content_data.payload))
        {
            return NRF_ERROR_INVALID_PARAM;
        }
        memcpy(content_data.payload, payload, payload_len);
    }
    else
    {
        payload_len = 0;
    }

    content_data.key_idx = key_idx;
    memcpy(content_data.device, device_id, sizeof(content_data.device));

    return history_add(type, (uint8_t*)&content_data, offsetof(history_ble_lock_t, payload) + payload_len);
}

ret_code_t history_add_time_changed(uint16_t key_idx, uint8_t const * device_id, uint32_t new_time, uint32_t time_before)
{
    history_time_changed_t content_data;

    if (!device_id)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    memset(&content_data, 0, sizeof(content_data));

    content_data.key_idx = key_idx;
    memcpy(content_data.device, device_id, sizeof(content_data.device));
    memcpy(content_data.new_time, &new_time, sizeof(content_data.new_time));
    memcpy(content_data.time_before, &time_before, sizeof(content_data.time_before));

    return history_add(HISTORY_TYPE_TIME_CHANGED, (uint8_t*)&content_data, sizeof(content_data));
}

ret_code_t history_add_autolock_updated_ex(uint16_t key_idx, uint8_t const * device_id, uint8_t enabled_before, uint8_t enabled_after, uint16_t second_before, uint16_t second_after, uint8_t* payload, uint8_t payload_len)
{
    history_autolock_updated_t content_data;

    memset(&content_data, 0, sizeof(content_data));

    if (!device_id)
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    if (payload)
    {
        if (payload_len == 0 || payload_len > sizeof(content_data.payload))
        {
            return NRF_ERROR_INVALID_PARAM;
        }
        memcpy(content_data.payload, payload, payload_len);
    }
    else
    {
        payload_len = 0;
    }

    content_data.key_idx = key_idx;
    memcpy(content_data.device, device_id, sizeof(content_data.device));
    content_data.enabled_before = enabled_before;
    content_data.enabled_after = enabled_after;
    content_data.second_before = second_before;
    content_data.second_after = second_after;

    return history_add(HISTORY_TYPE_AUTOLOCK_UPDATED, (uint8_t*)&content_data, offsetof(history_autolock_updated_t, payload) + payload_len);
}

ret_code_t history_add_simple_type(history_type_e type)
{
    return history_add(type, NULL, 0);
}

ret_code_t history_add_drive_failed(int16_t stopped_position, uint8_t fsm_ret_code, uint8_t in_lock_region, uint8_t in_unlock_region)
{
    history_drive_failed_t data;

    data.stopped_position = stopped_position;
    data.fsm_ret_code = fsm_ret_code;
    data.in_lock_region = in_lock_region;
    data.in_unlock_region = in_unlock_region;

    return history_add(HISTORY_TYPE_DRIVE_FAILED, &data, sizeof(data));
}

void history_set_time_reliable(uint8_t reliable)
{
    info.time_reliable = reliable;
}

bool history_transfer_enabled(uint16_t conn_handle)
{
    return (transfer.enabled && conn_handle == transfer.conn_handle);
}

#endif  // #ifdef DEPRECATED_DEFINITION
